## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 9 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     RESOURCE                                      |
|----------|-----------------------------------------------------------------------------------|
| update   | `aws_ssm_parameter.google_oauth_client_id`                                        |
|          | `aws_ssm_parameter.google_oauth_client_secret`                                    |
|          | `aws_ssm_parameter.superset_database_password`                                    |
|          | `aws_ssm_parameter.superset_database_username`                                    |
|          | `aws_ssm_parameter.superset_secret_key`                                           |
|          | `module.celery_beat_ecs.aws_iam_policy.this_task_exec`                            |
|          | `module.celery_worker_ecs.aws_iam_policy.this_task_exec`                          |
|          | `module.superset_db.aws_rds_cluster.cluster`                                      |
|          | `module.superset_ecs.aws_iam_policy.this_task_exec`                               |
| recreate | `aws_sns_topic_subscription.cloudwatch_alert_ok`                                  |
|          | `aws_sns_topic_subscription.cloudwatch_alert_warning`                             |
|          | `module.superset_db.aws_secretsmanager_secret_version.connection_string[0]`       |
|          | `module.superset_db.aws_secretsmanager_secret_version.proxy_connection_string[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_sns_topic_subscription.cloudwatch_alert_ok must be replaced
-/+ resource "aws_sns_topic_subscription" "cloudwatch_alert_ok" {
      ~ arn                             = "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok:01d94d72-36f2-4bd6-a9c6-4ed96d94df8b" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - endpoint                        = (sensitive value) -> null # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok:01d94d72-36f2-4bd6-a9c6-4ed96d94df8b" -> (known after apply)
      ~ owner_id                        = "066023111852" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.cloudwatch_alert_warning must be replaced
-/+ resource "aws_sns_topic_subscription" "cloudwatch_alert_warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning:647e2932-42be-4584-bfd3-553467dc0e0c" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - endpoint                        = (sensitive value) -> null # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning:647e2932-42be-4584-bfd3-553467dc0e0c" -> (known after apply)
      ~ owner_id                        = "066023111852" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_parameter.google_oauth_client_id will be updated in-place
  ~ resource "aws_ssm_parameter" "google_oauth_client_id" {
        id              = "google_oauth_client_id"
      + insecure_value  = (known after apply)
        name            = "google_oauth_client_id"
        tags            = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.google_oauth_client_secret will be updated in-place
  ~ resource "aws_ssm_parameter" "google_oauth_client_secret" {
        id              = "google_oauth_client_secret"
      + insecure_value  = (known after apply)
        name            = "google_oauth_client_secret"
        tags            = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.superset_database_password will be updated in-place
  ~ resource "aws_ssm_parameter" "superset_database_password" {
        id              = "superset_database_password"
      + insecure_value  = (known after apply)
        name            = "superset_database_password"
        tags            = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.superset_database_username will be updated in-place
  ~ resource "aws_ssm_parameter" "superset_database_username" {
        id              = "superset_database_username"
      + insecure_value  = (known after apply)
        name            = "superset_database_username"
        tags            = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.superset_secret_key will be updated in-place
  ~ resource "aws_ssm_parameter" "superset_secret_key" {
        id              = "superset_secret_key"
      + insecure_value  = (known after apply)
        name            = "superset_secret_key"
        tags            = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-beat:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::066023111852:policy/celery-beat_ecs_task_exec_policy"
        name             = "celery-beat_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-beat:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.celery_worker_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-worker:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.celery_worker_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::066023111852:policy/celery-worker_ecs_task_exec_policy"
        name             = "celery-worker_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-worker:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.superset_db.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      + enable_local_write_forwarding         = false
        id                                    = "superset-prod-cluster"
      - master_password                       = (sensitive value) -> null
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod-cluster"
            "Terraform"  = "true"
        }
        # (53 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret_version.connection_string[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-jNUoVF" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-jNUoVF|37CCC3E2-423A-44D1-BEC6-274F4027EB3A" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "37CCC3E2-423A-44D1-BEC6-274F4027EB3A" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret_version.proxy_connection_string[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-proxy-connection-string-7P0aoE" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-proxy-connection-string-7P0aoE|44879C38-B784-4E99-9A5E-25CAF08DC3B9" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "44879C38-B784-4E99-9A5E-25CAF08DC3B9" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.superset_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/superset:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.superset_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::066023111852:policy/superset_ecs_task_exec_policy"
        name             = "superset_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/superset:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 9 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
FAIL - plan.json - main - Postgresql main password > 8 characters: ["module.superset_db.aws_rds_cluster.cluster"]

25 tests, 18 passed, 6 warnings, 1 failure, 0 exceptions

```

</details>
